{
  "description": "Tarot cards with meanings, interpretations, and imagery references.",
  "cards": [
    {
      "name": "The Fool",
      "number": "0",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m00.jpg",
      "keywords_upright": ["Beginnings", "Innocence", "Spontaneity", "A Leap of Faith"],
      "keywords_reversed": ["Recklessness", "Hesitation", "Poor Judgement", "Apathy"],
      "meaning_upright": "The Fool represents new beginnings, a journey of faith, and embracing the unknown with an open heart. It's a card of infinite potential, urging you to take a chance and trust the universe. You are on the verge of an adventure without a care in the world.",
      "meaning_reversed": "When reversed, The Fool warns of naive decisions, a lack of foresight, or reckless behavior. You may be refusing to take an important leap out of fear, or acting with complete disregard for the consequences. It's a call to pause and think things through.",
      "advice": "Embrace your sense of adventure and be open to new experiences, but remember to look before you leap. A little planning will ensure your journey is successful."
    },
    {
      "name": "The Magician",
      "number": "1",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m01.jpg",
      "keywords_upright": ["Manifestation", "Resourcefulness", "Power", "Skill"],
      "keywords_reversed": ["Manipulation", "Untapped Talents", "Unpreparedness", "Trickery"],
      "meaning_upright": "The Magician is a master of manifestation. He has all the tools (air, water, fire, earth) and resources he needs to turn his visions into reality. This card signifies action, power, and the ability to make things happen through sheer will and skill.",
      "meaning_reversed": "The reversed Magician can indicate untapped potential, a lack of focus, or resources being wasted. It may also point to manipulation or trickery, either by you or someone else. You have the power, but you are not using it effectively.",
      "advice": "You have all the skills and resources you need to succeed. Now is the time to take action and manifest your desires. Focus your energy and believe in your own power."
    },
    {
      "name": "The High Priestess",
      "number": "2",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m02.jpg",
      "keywords_upright": ["Intuition", "Unconscious", "Inner Voice", "Secrets"],
      "keywords_reversed": ["Secrets Revealed", "Ignoring Intuition", "Repression", "Disconnection"],
      "meaning_upright": "The High Priestess is the guardian of the subconscious mind and the mysteries of the unseen world. She represents intuition, sacred knowledge, and the secrets that are not yet ready to be revealed. Trust your gut feelings and look beyond the obvious.",
      "meaning_reversed": "When reversed, the High Priestess suggests you are ignoring your intuition or that a secret is about to be revealed. You may feel disconnected from your inner voice or are refusing to look within for answers. It's a call to listen more deeply.",
      "advice": "Trust your intuition. The answers you seek may not be found in logic alone. Spend time in reflection, meditate, and pay attention to your dreams and inner world."
    },
    {
      "name": "The Empress",
      "number": "3",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m03.jpg",
      "keywords_upright": ["Femininity", "Beauty", "Nature", "Abundance", "Nurturing"],
      "keywords_reversed": ["Creative Block", "Dependence", "Smothering", "Infertility"],
      "meaning_upright": "The Empress is the ultimate symbol of feminine power, fertility, and abundance. She is a creator—of life, art, business, and home. She represents a deep connection to nature, beauty, and the senses. This card heralds a period of growth and luxurious comfort.",
      "meaning_reversed": "The reversed Empress can indicate a creative block, a lack of growth, or feeling disconnected from nature and your senses. It can also point to over-dependence or smothering love, either giving or receiving.",
      "advice": "Connect with nature and nurture your creative projects. Practice self-care and embrace beauty in your surroundings. If you feel blocked, focus on what you want to bring to life."
    },
    {
      "name": "The Emperor",
      "number": "4",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m04.jpg",
      "keywords_upright": ["Authority", "Structure", "Stability", "Foundation", "Control"],
      "keywords_reversed": ["Tyranny", "Rigidity", "Overcontrol", "Domineering"],
      "meaning_upright": "The Emperor represents structure, stability, and established authority. He is a ruler who creates order from chaos through clear rules and boundaries. This card signifies leadership, logical thinking, and the solid foundation required for long-term success.",
      "meaning_reversed": "Reversed, The Emperor can represent a misuse of power, being overly rigid or controlling. It can point to tyranny, a lack of discipline, or the complete rejection of structure and authority, leading to chaos.",
      "advice": "Take command of the situation and establish clear boundaries and rules. Lead with logic and authority, but be careful not to become overly rigid or domineering in the process."
    },
    {
      "name": "The Hierophant",
      "number": "5",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m05.jpg",
      "keywords_upright": ["Tradition", "Conformity", "Spirituality", "Institutions", "Beliefs"],
      "keywords_reversed": ["Non-conformity", "Rebellion", "New Beliefs", "Misalignment"],
      "meaning_upright": "The Hierophant is a symbol of tradition, spiritual guidance, and established institutions (like schools, religions, or belief systems). He represents seeking knowledge from a conventional source or mentor and conforming to a group's values.",
      "meaning_reversed": "The reversed Hierophant suggests rebellion against tradition, rejecting conventional wisdom, or non-conformity. You may be forging your own spiritual path or feeling that traditional institutions are out of alignment with your personal beliefs.",
      "advice": "Seek guidance from a trusted mentor or traditional source of knowledge. Alternatively, if you feel restricted, it may be time to question established norms and find your own truth."
    },
    {
      "name": "The Lovers",
      "number": "6",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m06.jpg",
      "keywords_upright": ["Love", "Harmony", "Partnerships", "Choices", "Union"],
      "keywords_reversed": ["Disharmony", "Imbalance", "Misalignment of Values", "Conflict"],
      "meaning_upright": "The Lovers card represents deep emotional bonds, romantic relationships, and meaningful partnerships. It also signifies important choices that align with your values and desires. This card encourages harmony, trust, and open communication in relationships.",
      "meaning_reversed": "When reversed, The Lovers can indicate disharmony, imbalance, or conflict in relationships. It may also point to a misalignment of values or difficult choices that lead to regret. You may be struggling to find harmony within yourself or with others.",
      "advice": "Focus on building strong, honest relationships based on mutual respect and shared values. When faced with choices, ensure they align with your true self and long-term happiness."
    },
    {
      "name": "The Chariot",
      "number": "7",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m07.jpg",
      "keywords_upright": ["Control", "Willpower", "Victory", "Determination", "Ambition"],
      "keywords_reversed": ["Lack of Control", "Aggression", "Obstacles", "Defeat"],
      "meaning_upright": "The Chariot signifies triumph through determination and willpower. It represents overcoming obstacles and achieving victory by harnessing your inner strength and focus. This card encourages you to take control of your path and drive forward with confidence.",
      "meaning_reversed": "Reversed, The Chariot can indicate a lack of control, aggression, or being overwhelmed by obstacles. You may be struggling to maintain direction or facing defeat due to scattered energy or external challenges.",
      "advice": "Stay focused on your goals and maintain control over your emotions and actions. Use your determination to overcome obstacles, but be mindful of becoming too aggressive or forceful."
    },
    {
      "name": "Strength",
      "number": "8",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m08.jpg",
      "keywords_upright": ["Courage", "Compassion", "Inner Strength", "Patience", "Control"],
      "keywords_reversed": ["Self-Doubt", "Weakness", "Insecurity", "Lack of Control"],
      "meaning_upright": "Strength represents inner courage, compassion, and the ability to overcome challenges through patience and gentle control. It signifies mastering your fears and impulses, showing resilience in the face of adversity.",
      "meaning_reversed": "When reversed, Strength can indicate self-doubt, insecurity, or a lack of inner strength. You may be feeling overwhelmed by challenges or struggling to control your emotions and impulses.",
      "advice": "Tap into your inner reserves of courage and compassion. Face challenges with patience and kindness, both towards yourself and others. Believe in your own strength."
    },
    {
      "name": "The Hermit",
      "number": "9",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m09.jpg",
      "keywords_upright": ["Introspection", "Solitude", "Guidance", "Inner Wisdom", "Reflection"],
      "keywords_reversed": ["Isolation", "Loneliness", "Withdrawal", "Lost Path"],
      "meaning_upright": "The Hermit represents a period of introspection, solitude, and seeking inner wisdom. It encourages you to withdraw from the external world to reflect and find guidance within yourself. This card signifies a journey of self-discovery and enlightenment.",
      "meaning_reversed": "Reversed, The Hermit can indicate feelings of isolation, loneliness, or being lost. You may be withdrawing too much from the world or struggling to find your path. It suggests a need to reconnect with others and seek external guidance.",
      "advice": "Take time for self-reflection and solitude to gain clarity and insight. However, be cautious of isolating yourself too much; balance introspection with social connection."
    },
    {
      "name": "Wheel of Fortune",
      "number": "10",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m10.jpg",
      "keywords_upright": ["Change", "Cycles", "Fate", "Luck", "Destiny"],
      "keywords_reversed": ["Resistance to Change", "Bad Luck", "Stagnation", "Misfortune"],
      "meaning_upright": "The Wheel of Fortune signifies the cyclical nature of life, change, and destiny. It represents the ups and downs we all experience and encourages embracing change as a natural part of growth. This card often indicates a turning point or a stroke of luck.",
      "meaning_reversed": "When reversed, the Wheel of Fortune can indicate resistance to change, bad luck, or stagnation. You may be feeling stuck in a rut or struggling against the natural flow of life. It suggests a need to let go and accept the changes coming your way.",
      "advice": "Embrace the changes in your life and trust that they are part of a larger cycle. Be open to new opportunities and understand that both good and bad times are temporary."
    },
    {
      "name": "Justice",
      "number": "11",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m11.jpg",
      "keywords_upright": ["Fairness", "Truth", "Law", "Cause and Effect", "Accountability"],
      "keywords_reversed": ["Injustice", "Dishonesty", "Unfairness", "Lack of Accountability"],
      "meaning_upright": "Justice represents fairness, truth, and the law of cause and effect. It signifies the need for balance and accountability in your actions. This card encourages you to seek truth and make decisions based on integrity and fairness.",
      "meaning_reversed": "Reversed, Justice can indicate injustice, dishonesty, or a lack of accountability. You may be facing unfair treatment or struggling to accept responsibility for your actions. It suggests a need to reassess your values and actions.",
      "advice": "Strive for fairness and integrity in all your dealings. Take responsibility for your actions and seek the truth in situations. Ensure that your decisions are just and balanced."
    },
    {
      "name": "The Hanged",
      "number": "12",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m12.jpg",
      "keywords_upright": ["Pause", "Surrender", "New Perspectives", "Letting Go", "Sacrifice"],
      "keywords_reversed": ["Delays", "Resistance", "Stagnation", "Indecision"],
      "meaning_upright": "The Hanged represents a period of pause, surrender, and gaining new perspectives. It encourages letting go of control and embracing a different viewpoint. This card often signifies a necessary sacrifice for greater understanding or growth.",
      "meaning_reversed": "When reversed, The Hanged can indicate delays, resistance to change, or stagnation. You may be struggling to let go or feeling indecisive about a situation. It suggests a need to release control and embrace new perspectives.",
      "advice": "Take a step back and allow yourself to see things from a different angle. Embrace the pause and surrender control where necessary. This period of reflection can lead to greater insight and growth."
    },
    {
      "name": "Death",
      "number": "13",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m13.jpg",
      "keywords_upright": ["Transformation", "Endings", "New Beginnings", "Change", "Transition"],
      "keywords_reversed": ["Resistance to Change", "Stagnation", "Fear of Change", "Holding On"],
      "meaning_upright": "Death signifies transformation, endings, and new beginnings. It represents the natural cycle of life, where one phase ends to make way for another. This card encourages embracing change and letting go of what no longer serves you.",
      "meaning_reversed": "Reversed, Death can indicate resistance to change, stagnation, or a fear of the unknown. You may be holding on to the past or struggling to accept necessary endings. It suggests a need to embrace transformation for growth.",
      "advice": "Embrace the changes in your life and let go of what no longer serves you. Trust that endings lead to new beginnings and that transformation is a natural part of growth."
    },
    {
      "name": "Temperance",
      "number": "14",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m14.jpg",
      "keywords_upright": ["Balance", "Moderation", "Patience", "Purpose", "Harmony"],
      "keywords_reversed": ["Imbalance", "Excess", "Lack of Long-Term Vision", "Disharmony"],
      "meaning_upright": "Temperance represents balance, moderation, and harmony. It encourages patience and finding the middle path in all aspects of life. This card signifies the blending of opposites and the importance of maintaining equilibrium.",
      "meaning_reversed": "When reversed, Temperance can indicate imbalance, excess, or a lack of long-term vision. You may be struggling to find harmony in your life or indulging in unhealthy behaviors. It suggests a need to reassess your priorities and restore balance.",
      "advice": "Strive for balance and moderation in all areas of your life. Practice patience and seek harmony in your relationships and endeavors. Avoid extremes and focus on long-term well-being."
    },
    {
      "name": "The Devil",
      "number": "15",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m15.jpg",
      "keywords_upright": ["Bondage", "Addiction", "Materialism", "Shadow Self", "Temptation"],
      "keywords_reversed": ["Freedom", "Release", "Detachment", "Breaking Free"],
      "meaning_upright": "The Devil represents bondage, addiction, and materialism. It signifies being trapped by unhealthy attachments or behaviors, often driven by fear or temptation. This card encourages confronting your shadow self and recognizing the chains that bind you.",
      "meaning_reversed": "Reversed, The Devil can indicate freedom, release, and breaking free from unhealthy attachments. You may be overcoming addictions or detaching from materialistic pursuits. It suggests a path towards liberation and self-empowerment.",
      "advice": "Confront your fears and recognize any unhealthy attachments in your life. Seek freedom from what binds you and focus on personal empowerment and growth."
    },
    {
      "name": "The Tower",
      "number": "16",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m16.jpg",
      "keywords_upright": ["Sudden Change", "Upheaval", "Revelation", "Awakening", "Breakdown"],
      "keywords_reversed": ["Avoidance of Disaster", "Fear of Change", "Delays", "Resistance"],
      "meaning_upright": "The Tower signifies sudden change, upheaval, and revelation. It represents the breaking down of old structures and beliefs to make way for new growth. This card often indicates a dramatic shift or awakening that can be unsettling but ultimately transformative.",
      "meaning_reversed": "When reversed, The Tower can indicate avoidance of disaster, fear of change, or delays in necessary upheaval. You may be resisting a needed transformation or clinging to old ways that no longer serve you. It suggests a need to face change head-on.",
      "advice": "Embrace change and be open to transformation, even if it feels unsettling. Sometimes old structures must fall for new growth to occur. Trust that this upheaval will lead to greater clarity and strength."
    },
    {
      "name": "The Star",
      "number": "17",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m17.jpg",
      "keywords_upright": ["Hope", "Inspiration", "Serenity", "Renewal", "Spirituality"],
      "keywords_reversed": ["Lack of Faith", "Despair", "Disconnection", "Hopelessness"],
      "meaning_upright": "The Star represents hope, inspiration, and spiritual renewal. It signifies a period of calm and clarity after turmoil, encouraging you to have faith in the future. This card is a beacon of light, guiding you towards your dreams and aspirations.",
      "meaning_reversed": "Reversed, The Star can indicate a lack of faith, despair, or disconnection from your spiritual path. You may be feeling hopeless or struggling to find inspiration. It suggests a need to reconnect with your inner light and trust in the future.",
      "advice": "Maintain hope and stay inspired, even in challenging times. Connect with your spirituality and trust that the universe is guiding you towards your highest good."
    },
    {
      "name": "The Moon",
      "number": "18",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m18.jpg",
      "keywords_upright": ["Illusion", "Intuition", "Subconscious", "Mystery", "Fear"],
      "keywords_reversed": ["Clarity", "Truth Revealed", "Overcoming Fear", "Confusion"],
      "meaning_upright": "The Moon represents illusion, intuition, and the subconscious mind. It signifies a time of uncertainty and mystery, where things may not be as they seem. This card encourages you to trust your intuition and explore the deeper aspects of your psyche.",
      "meaning_reversed": "When reversed, The Moon can indicate clarity, truth revealed, or overcoming fear. You may be breaking through confusion or illusions that have clouded your judgment. It suggests a need to face your fears and seek the truth.",
      "advice": "Trust your intuition and be cautious of illusions or deception. Take time to explore your subconscious mind and confront any fears that may be holding you back."
    },
    {
      "name": "The Sun",
      "number": "19",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m19.jpg",
      "keywords_upright": ["Joy", "Success", "Positivity", "Vitality", "Enlightenment"],
      "keywords_reversed": ["Temporary Setbacks", "Lack of Clarity", "Overconfidence", "Depression"],
      "meaning_upright": "The Sun represents joy, success, and positivity. It signifies a time of vitality, enlightenment, and overall well-being. This card encourages you to embrace the light and celebrate your achievements and happiness.",
      "meaning_reversed": "Reversed, The Sun can indicate temporary setbacks, lack of clarity, or overconfidence. You may be experiencing a dip in your usual positivity or struggling to see the light in a situation. It suggests a need to regain your optimism and focus on the bright side.",
      "advice": "Embrace joy and positivity in your life. Celebrate your successes and focus on the things that bring you happiness. Even in challenging times, look for the light and maintain an optimistic outlook."
    },
    {
      "name": "Judgement",
      "number": "20",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m20.jpg",
      "keywords_upright": ["Rebirth", "Inner Calling", "Absolution", "Awakening", "Renewal"],
      "keywords_reversed": ["Self-Doubt", "Ignoring the Call", "Stagnation", "Lack of Reflection"],
      "meaning_upright": "Judgement represents rebirth, inner calling, and awakening. It signifies a time of reflection and evaluation, where you are called to assess your past actions and make amends. This card encourages you to listen to your inner voice and embrace renewal.",
      "meaning_reversed": "When reversed, Judgement can indicate self-doubt, ignoring the call, or stagnation. You may be avoiding necessary reflection or feeling disconnected from your inner guidance. It suggests a need to confront your past and embrace growth.",
        "advice": "Take time to reflect on your life and listen to your inner calling. Embrace opportunities for renewal and growth, and be willing to make changes based on your reflections."
    },
    {
      "name": "The World",
      "number": "21",
      "arcana": "Major Arcana",
      "suit": null,
      "img": "m21.jpg",
      "keywords_upright": ["Completion", "Fulfillment", "Wholeness", "Achievement", "Travel"],
      "keywords_reversed": ["Incomplete Goals", "Lack of Closure", "Delays", "Stagnation"],
      "meaning_upright": "The World signifies completion, fulfillment, and wholeness. It represents the successful conclusion of a journey or project and the achievement of your goals. This card encourages you to celebrate your accomplishments and embrace a sense of unity with the world.",
      "meaning_reversed": "Reversed, The World can indicate incomplete goals, lack of closure, or delays. You may be feeling stuck or unable to move forward due to unfinished business. It suggests a need to tie up loose ends and find closure.",
      "advice": "Celebrate your achievements and take pride in how far you've come. If there are unfinished goals, focus on bringing them to completion to experience a sense of wholeness and fulfillment."
    },
    {
      "name": "Ace of Cups",
      "number": "1",
      "arcana": "Minor Arcana",
      "suit": "Cups",
      "img": "c01.jpg",
      "keywords_upright": ["New Love", "Compassion", "Creativity", "Emotional Beginnings"],
      "keywords_reversed": ["Blocked Emotions", "Repressed Feelings", "Emotional Loss", "Heartbreak"],
      "meaning_upright": "The Ace of Cups represents new emotional beginnings, love, and compassion. It signifies the start of a new relationship, creative project, or a deepening of emotional connections. This card encourages you to open your heart and embrace the flow of positive emotions.",
      "meaning_reversed": "When reversed, the Ace of Cups can indicate blocked emotions, repressed feelings, or emotional loss. You may be struggling to express your true feelings or experiencing heartbreak. It suggests a need to heal and release emotional baggage.",
      "advice": "Open your heart to new emotional experiences and allow yourself to feel deeply. If you're facing emotional challenges, take time to heal and process your feelings."
    },
    {
      "name": "Two of Cups",
      "number": "2",
      "arcana": "Minor Arcana",
      "suit": "Cups",
      "img": "c02.jpg",
      "keywords_upright": ["Partnership", "Mutual Attraction", "Connection", "Unity"],
      "keywords_reversed": ["Breakup", "Disharmony", "Imbalance", "Toxic Relationship"],
      "meaning_upright": "The Two of Cups represents partnership, mutual attraction, and emotional connection. It signifies a harmonious relationship, whether romantic or platonic, built on trust and respect. This card encourages you to nurture your connections and celebrate unity.",
      "meaning_reversed": "Reversed, the Two of Cups can indicate a breakup, disharmony, or imbalance in a relationship. You may be experiencing conflict or feeling disconnected from someone important. It suggests a need to address issues and restore harmony.",
      "advice": "Focus on building and maintaining healthy relationships based on mutual respect and understanding. If conflicts arise, address them openly and work towards reconciliation."
    },
    {
      "name": "Three of Cups",
      "number": "3",
      "arcana": "Minor Arcana",
      "suit": "Cups",
      "img": "c03.jpg",
      "keywords_upright": ["Celebration", "Friendship", "Community", "Joy"],
      "keywords_reversed": ["Overindulgence", "Gossip", "Isolation", "Lack of Support"],
      "meaning_upright": "The Three of Cups signifies celebration, friendship, and community. It represents joyful gatherings, social connections, and the support of friends. This card encourages you to embrace the joy of togetherness and celebrate your relationships.",
      "meaning_reversed": "When reversed, the Three of Cups can indicate overindulgence, gossip, or isolation. You may be feeling disconnected from your social circle or experiencing conflicts within your community. It suggests a need to reassess your relationships and seek genuine connections.",
      "advice": "Celebrate your friendships and the joy of community. Be mindful of overindulgence and focus on building authentic relationships based on trust and support."
    },
    {
      "name": "Four of Cups",
      "number": "4",
      "arcana": "Minor Arcana",
      "suit": "Cups",
      "img": "c04.jpg",
      "keywords_upright": ["Apathy", "Contemplation", "Disconnectedness", "Reevaluation"],
      "keywords_reversed": ["Awakening", "New Opportunities", "Acceptance", "Gratitude"],
      "meaning_upright": "The Four of Cups represents apathy, contemplation, and a sense of disconnectedness. It signifies a period of reevaluation, where you may be feeling bored or dissatisfied with your current emotional state. This card encourages you to look inward and reassess your desires.",
      "meaning_reversed": "Reversed, the Four of Cups can indicate awakening, new opportunities, or acceptance. You may be opening up to new emotional experiences or finding gratitude for what you have. It suggests a shift in perspective and a renewed sense of appreciation.",
      "advice": "Take time to reflect on your emotional state and what truly fulfills you. Be open to new opportunities and practice gratitude for the blessings in your life."
    },
    {
      "name": "Five of Cups",
      "number": "5",
      "arcana": "Minor Arcana",
      "suit": "Cups",
      "img": "c05.jpg",
      "keywords_upright": ["Loss", "Grief", "Disappointment", "Regret"],
      "keywords_reversed": ["Acceptance", "Moving On", "Forgiveness", "Healing"],
      "meaning_upright": "The Five of Cups signifies loss, grief, and disappointment. It represents a period of mourning or regret over what has been lost. This card encourages you to acknowledge your feelings but also to look for the remaining positives in your life.",
      "meaning_reversed": "When reversed, the Five of Cups can indicate acceptance, moving on, and healing. You may be finding forgiveness and letting go of past disappointments. It suggests a path towards emotional recovery and renewed hope.",
      "advice": "Allow yourself to grieve and process your emotions, but also focus on the positives that remain. Practice forgiveness and take steps towards healing and moving forward."
    },
    {
      "name": "Six of Cups",
      "number": "6",
      "arcana": "Minor Arcana",
      "suit": "Cups",
      "img": "c06.jpg",
      "keywords_upright": ["Nostalgia", "Reunion", "Innocence", "Childhood Memories"],
      "keywords_reversed": ["Stuck in the Past", "Naivety", "Unrealistic Expectations", "Letting Go"],
      "meaning_upright": "The Six of Cups represents nostalgia, reunion, and innocence. It signifies a connection to childhood memories and the joy of simpler times. This card encourages you to embrace your inner child and find happiness in the present moment.",
        "meaning_reversed": "Reversed, the Six of Cups can indicate being stuck in the past, naivety, or unrealistic expectations. You may be struggling to let go of old memories or idealizing the past. It suggests a need to focus on the present and future rather than dwelling on what once was.",
        "advice": "Embrace the joy and innocence of your inner child, but be mindful of getting stuck in the past. Focus on creating new memories and experiences in the present."
    },
    {
      "name": "Seven of Cups",
      "number": "7",
      "arcana": "Minor Arcana",
      "suit": "Cups",
      "img": "c07.jpg",
      "keywords_upright": ["Choices", "Imagination", "Daydreaming", "Illusion"],
      "keywords_reversed": ["Clarity", "Focus", "Realistic Choices", "Overwhelm"],
      "meaning_upright": "The Seven of Cups signifies choices, imagination, and daydreaming. It represents a time of exploring possibilities and options, but also warns of illusions and unrealistic expectations. This card encourages you to use your imagination wisely and make thoughtful decisions.",
      "meaning_reversed": "When reversed, the Seven of Cups can indicate clarity, focus, and realistic choices. You may be overcoming overwhelm and gaining a clearer perspective on your options. It suggests a need to prioritize and make decisions based on practicality.",
      "advice": "Explore your options and use your imagination, but be cautious of getting lost in illusions. Focus on what is realistic and practical when making decisions."
    },
    {
      "name": "Eight of Cups",
      "number": "8",
      "arcana": "Minor Arcana",
      "suit": "Cups",
      "img": "c08.jpg",
      "keywords_upright": ["Withdrawal", "Seeking Truth", "Leaving Behind", "Spiritual Journey"],
      "keywords_reversed": ["Avoidance", "Fear of Change", "Stagnation", "Indecision"],
      "meaning_upright": "The Eight of Cups represents withdrawal, seeking truth, and leaving behind what no longer serves you. It signifies a spiritual journey or a quest for deeper meaning. This card encourages you to let go of the past and move forward in search of fulfillment.",
      "meaning_reversed": "Reversed, the Eight of Cups can indicate avoidance, fear of change, or stagnation. You may be struggling to leave behind old patterns or feeling indecisive about your path. It suggests a need to confront your fears and embrace change.",
      "advice": "Be willing to let go of what no longer serves you and seek deeper meaning in your life. Embrace change and trust that moving forward will lead to greater fulfillment."
    },
    {
      "name": "Nine of Cups",
      "number": "9",
      "arcana": "Minor Arcana",
      "suit": "Cups",
      "img": "c09.jpg",
      "keywords_upright": ["Contentment", "Satisfaction", "Gratitude", "Emotional Fulfillment"],
      "keywords_reversed": ["Greed", "Dissatisfaction", "Overindulgence", "Lack of Gratitude"],
      "meaning_upright": "The Nine of Cups signifies contentment, satisfaction, and emotional fulfillment. It represents a time of gratitude and appreciation for the blessings in your life. This card encourages you to celebrate your achievements and enjoy the fruits of your labor.",
      "meaning_reversed": "When reversed, the Nine of Cups can indicate greed, dissatisfaction, or overindulgence. You may be struggling to find contentment or feeling ungrateful for what you have. It suggests a need to reassess your values and focus on true fulfillment.",
      "advice": "Practice gratitude and appreciate the blessings in your life. Focus on what truly brings you joy and fulfillment, rather than material possessions or superficial desires."
    },
    {
      "name": "Ten of Cups",
      "number": "10",
      "arcana": "Minor Arcana",
      "suit": "Cups",
      "img": "c10.jpg",
      "keywords_upright": ["Happiness", "Family", "Harmony", "Emotional Completion"],
      "keywords_reversed": ["Broken Relationships", "Disconnection", "Family Issues", "Unhappiness"],
      "meaning_upright": "The Ten of Cups represents happiness, family, and emotional completion. It signifies a harmonious and fulfilling relationship, often within the family unit. This card encourages you to cherish your loved ones and celebrate the joy of togetherness.",
      "meaning_reversed": "Reversed, the Ten of Cups can indicate broken relationships, disconnection, or family issues. You may be experiencing conflict or feeling unhappy in your personal life. It suggests a need to address these issues and work towards healing and harmony.",
      "advice": "Focus on building strong, loving relationships with your family and loved ones. Address any conflicts openly and work towards creating a harmonious environment."
    },
    {
      "name": "Page of Cups",
      "number": "11",
      "arcana": "Minor Arcana",
      "suit": "Cups",
      "img": "c11.jpg",
      "keywords_upright": ["Creativity", "Inspiration", "Emotional Openness", "New Ideas"],
      "keywords_reversed": ["Emotional Immaturity", "Creative Block", "Lack of Direction", "Overly Idealistic"],
      "meaning_upright": "The Page of Cups represents creativity, inspiration, and emotional openness. It signifies a youthful and imaginative energy, encouraging you to explore new ideas and express your emotions freely. This card often indicates the beginning of a creative project or emotional journey.",
      "meaning_reversed": "When reversed, the Page of Cups can indicate emotional immaturity, creative block, or lack of direction. You may be struggling to find your creative voice or feeling disconnected from your emotions. It suggests a need to ground yourself and find clarity.",
      "advice": "Embrace your creativity and allow yourself to be open to new ideas and emotional experiences. If you're feeling stuck, take time to reflect and find your direction."
    },
    {
      "name": "Knight of Cups",
      "number": "12",
      "arcana": "Minor Arcana",
      "suit": "Cups",
      "img": "c12.jpg",
      "keywords_upright": ["Romance", "Charm", "Imagination", "Following the Heart"],
      "keywords_reversed": ["Moodiness", "Unrealistic Expectations", "Overly Idealistic", "Disappointment"],
      "meaning_upright": "The Knight of Cups represents romance, charm, and imagination. It signifies a person who follows their heart and pursues their dreams with passion. This card encourages you to embrace your romantic side and be open to new emotional experiences.",
      "meaning_reversed": "Reversed, the Knight of Cups can indicate moodiness, unrealistic expectations, or disappointment. You may be struggling with emotional ups and downs or feeling let down by unmet ideals. It suggests a need to ground your emotions and manage expectations.",
      "advice": "Follow your heart and embrace your romantic and imaginative side. However, be mindful of unrealistic expectations and strive for emotional balance."
    },
    {
      "name": "Queen of Cups",
      "number": "13",
      "arcana": "Minor Arcana",
      "suit": "Cups",
      "img": "c13.jpg",
      "keywords_upright": ["Compassion", "Calm", "Emotional Security", "Intuition"],
      "keywords_reversed": ["Emotional Insecurity", "Codependency", "Overly Sensitive", "Blocked Intuition"],
      "meaning_upright": "The Queen of Cups represents compassion, calm, and emotional security. She signifies a nurturing and empathetic energy, encouraging you to trust your intuition and care for others. This card often indicates emotional maturity and deep understanding.",
      "meaning_reversed": "When reversed, the Queen of Cups can indicate emotional insecurity, codependency, or being overly sensitive. You may be struggling to maintain emotional balance or feeling disconnected from your intuition. It suggests a need to focus on self-care and emotional healing.",
      "advice": "Cultivate compassion and empathy, both for yourself and others. Trust your intuition and seek emotional balance through self-care and nurturing relationships."
    },
    {
      "name": "King of Cups",
      "number": "14",
      "arcana": "Minor Arcana",
      "suit": "Cups",
      "img": "c14.jpg",
      "keywords_upright": ["Emotional Balance", "Diplomacy", "Compassion", "Control"],
      "keywords_reversed": ["Emotional Manipulation", "Coldness", "Moodiness", "Lack of Control"],
      "meaning_upright": "The King of Cups represents emotional balance, diplomacy, and compassion. He signifies a mature and controlled emotional energy, encouraging you to lead with kindness and understanding. This card often indicates the ability to navigate complex emotional situations with grace.",
      "meaning_reversed": "Reversed, the King of Cups can indicate emotional manipulation, coldness, or moodiness. You may be struggling to control your emotions or using them to manipulate others. It suggests a need to regain emotional balance and integrity.",
      "advice": "Strive for emotional balance and lead with compassion and understanding. Avoid manipulation and focus on maintaining integrity in your relationships."
    },
    {
      "name" : "Ace of Swords",
      "number": "1",
      "arcana": "Minor Arcana",
      "suit": "Swords",
      "img": "s01.jpg",
      "keywords_upright": ["New Ideas", "Clarity", "Truth", "Breakthroughs"],
      "keywords_reversed": ["Confusion", "Lack of Clarity", "Miscommunication", "Delays"],
      "meaning_upright": "The Ace of Swords represents new ideas, clarity, and breakthroughs. It signifies a moment of mental clarity and the ability to see things from a new perspective. This card encourages you to embrace truth and use your intellect to overcome challenges.",
      "meaning_reversed": "When reversed, the Ace of Swords can indicate confusion, lack of clarity, or miscommunication. You may be struggling to find direction or facing delays in your plans. It suggests a need to reassess your thoughts and seek clear communication.",
      "advice": "Embrace new ideas and seek clarity in your thoughts. Use your intellect to navigate challenges and communicate effectively. Be open to breakthroughs and new perspectives."
    },
    {
      "name": "Two of Swords",
      "number": "2",
      "arcana": "Minor Arcana",
      "suit": "Swords",
      "img": "s02.jpg",
      "keywords_upright": ["Indecision", "Choices", "Blocked Emotions", "Stalemate"],
      "keywords_reversed": ["Clarity", "Decision-Making", "Overcoming Fear", "Moving Forward"],
      "meaning_upright": "The Two of Swords represents indecision, choices, and blocked emotions. It signifies a stalemate or a situation where you are avoiding making a decision. This card encourages you to confront your fears and find balance in your thoughts and emotions.",
      "meaning_reversed": "Reversed, the Two of Swords can indicate clarity, decision-making, and overcoming fear. You may be finding the courage to make a choice and move forward. It suggests a need to trust your intuition and take action.",
      "advice": "Face your fears and make decisions with confidence. Seek balance between your thoughts and emotions, and trust your intuition to guide you forward."
    },
    {
      "name": "Three of Swords",
      "number": "3",
      "arcana": "Minor Arcana",
      "suit": "Swords",
      "img": "s03.jpg",
      "keywords_upright": ["Heartbreak", "Emotional Pain", "Separation", "Grief"],
      "keywords_reversed": ["Healing", "Recovery", "Forgiveness", "Moving On"],
      "meaning_upright": "The Three of Swords signifies heartbreak, emotional pain, and separation. It represents a period of grief or sorrow, often related to relationships. This card encourages you to acknowledge your pain and allow yourself to heal.",
      "meaning_reversed": "When reversed, the Three of Swords can indicate healing, recovery, and forgiveness. You may be finding ways to move on from past hurts and rebuild your emotional strength. It suggests a path towards emotional recovery and renewed hope.",
      "advice": "Allow yourself to feel and process your emotional pain. Seek healing through forgiveness and self-care, and take steps towards moving on and rebuilding your emotional well-being."
    },
    {
      "name": "Four of Swords",
      "number": "4",
      "arcana": "Minor Arcana",
      "suit": "Swords",
      "img": "s04.jpg",
      "keywords_upright": ["Rest", "Recovery", "Contemplation", "Solitude"],
      "keywords_reversed": ["Burnout", "Stress", "Overwhelm", "Lack of Rest"],
      "meaning_upright": "The Four of Swords represents rest, recovery, and contemplation. It signifies a need to take a break and recharge your energy. This card encourages you to seek solitude and reflect on your thoughts and emotions.",
      "meaning_reversed": "Reversed, the Four of Swords can indicate burnout, stress, or overwhelm. You may be struggling to find time for rest or feeling overburdened by responsibilities. It suggests a need to prioritize self-care and create space for relaxation.",
      "advice": "Take time to rest and recharge your energy. Seek solitude for reflection and prioritize self-care to avoid burnout and stress."
    },
    {
      "name": "Five of Swords",
      "number": "5",
      "arcana": "Minor Arcana",
      "suit": "Swords",
      "img": "s05.jpg",
      "keywords_upright": ["Conflict", "Defeat", "Betrayal", "Tension"],
      "keywords_reversed": ["Reconciliation", "Making Amends", "Forgiveness", "Moving On"],
      "meaning_upright": "The Five of Swords signifies conflict, defeat, and betrayal. It represents a situation where there may be tension or disagreement, often leading to feelings of loss or resentment. This card encourages you to consider the consequences of your actions and seek resolution.",
      "meaning_reversed": "When reversed, the Five of Swords can indicate reconciliation, making amends, and forgiveness. You may be finding ways to resolve conflicts and move forward with a sense of peace. It suggests a path towards healing and restoring relationships.",
      "advice": "Be mindful of conflicts and their consequences. Seek resolution through communication and forgiveness, and focus on moving forward with a sense of peace."
    },
    {
      "name": "Six of Swords",
      "number": "6",
      "arcana": "Minor Arcana",
      "suit": "Swords",
      "img": "s06.jpg",
      "keywords_upright": ["Transition", "Moving On", "Journey", "Recovery"],
      "keywords_reversed": ["Resistance to Change", "Stagnation", "Unresolved Issues", "Fear of the Unknown"],
      "meaning_upright": "The Six of Swords represents transition, moving on, and recovery. It signifies a journey, either physical or emotional, towards a better situation. This card encourages you to embrace change and look forward to new opportunities.",
      "meaning_reversed": "Reversed, the Six of Swords can indicate resistance to change, stagnation, or unresolved issues. You may be struggling to move forward or facing fears about the unknown. It suggests a need to confront these fears and embrace the journey ahead.",
      "advice": "Embrace transitions and look forward to new opportunities. Let go of fears and unresolved issues that may be holding you back from moving forward."
    },
    {
      "name": "Seven of Swords",
      "number": "7",
      "arcana": "Minor Arcana",
      "suit": "Swords",
      "img": "s07.jpg",
      "keywords_upright": ["Deception", "Strategy", "Cunning", "Stealth"],
      "keywords_reversed": ["Confession", "Confrontation", "Accountability", "Truth Revealed"],
      "meaning_upright": "The Seven of Swords signifies deception, strategy, and cunning. It represents a situation where you may need to be strategic or cautious in your actions. This card encourages you to think carefully about your plans and be aware of potential deceit.",
      "meaning_reversed": "When reversed, the Seven of Swords can indicate confession, confrontation, and accountability. You may be facing the consequences of deceit or being called to reveal the truth. It suggests a need to take responsibility for your actions and seek honesty.",
      "advice": "Be strategic and cautious in your actions, but also strive for honesty and integrity. If you've been deceptive, consider confessing and taking accountability for your actions."
    },
    {
      "name": "Eight of Swords",
      "number": "8",
      "arcana": "Minor Arcana",
      "suit": "Swords",
      "img": "s08.jpg",
      "keywords_upright": ["Restriction", "Limitation", "Feeling Trapped", "Self-Imposed Boundaries"],
      "keywords_reversed": ["Freedom", "Release", "Overcoming Obstacles", "Empowerment"],
      "meaning_upright": "The Eight of Swords represents restriction, limitation, and feeling trapped. It signifies a situation where you may feel confined by circumstances or self-imposed boundaries. This card encourages you to recognize that you have the power to change your situation.",
      "meaning_reversed": "Reversed, the Eight of Swords can indicate freedom, release, and overcoming obstacles. You may be finding ways to break free from limitations and regain control over your life. It suggests a path towards empowerment and liberation.",
      "advice": "Recognize that you have the power to change your situation. Challenge self-imposed boundaries and seek ways to overcome obstacles and regain your freedom."
    },
    {
      "name": "Nine of Swords",
      "number": "9",
      "arcana": "Minor Arcana",
      "suit": "Swords",
      "img": "s09.jpg",
      "keywords_upright": ["Anxiety", "Worry", "Nightmares", "Mental Anguish"],
      "keywords_reversed": ["Relief", "Recovery", "Overcoming Fear", "Hope"],
      "meaning_upright": "The Nine of Swords signifies anxiety, worry, and mental anguish. It represents a period of sleepless nights or overwhelming thoughts that may be causing distress. This card encourages you to confront your fears and seek support if needed.",
      "meaning_reversed": "When reversed, the Nine of Swords can indicate relief, recovery, and overcoming fear. You may be finding ways to manage your anxiety and regain a sense of peace. It suggests a path towards hope and mental clarity.",
      "advice": "Confront your fears and seek support if needed. Practice self-care and focus on finding relief from anxiety and mental distress."

    },
    {
      "name": "Ten of Swords",
      "number": "10",
      "arcana": "Minor Arcana",
      "suit": "Swords",
      "img": "s10.jpg",
      "keywords_upright": ["Endings", "Betrayal", "Loss", "Rock Bottom"],
      "keywords_reversed": ["Recovery", "Regeneration", "Resilience", "New Beginnings"],
      "meaning_upright": "The Ten of Swords represents endings, betrayal, and loss. It signifies a painful conclusion or a situation that has reached its lowest point. This card encourages you to accept the end and look for opportunities to rebuild and move forward.",
      "meaning_reversed": "Reversed, the Ten of Swords can indicate recovery, regeneration, and resilience. You may be finding ways to bounce back from adversity and embrace new beginnings. It suggests a path towards healing and renewal.",
      "advice": "Accept endings and look for opportunities to rebuild. Focus on your resilience and embrace new beginnings with hope and determination."
    },

    {
      "name": "Page of Swords",
      "number": "11",
      "arcana": "Minor Arcana",
      "suit": "Swords",
      "img": "s11.jpg",
      "keywords_upright": ["Curiosity", "Mental Energy", "New Ideas", "Communication"],
      "keywords_reversed": ["Deception", "Lack of Clarity", "Gossip", "Miscommunication"],
      "meaning_upright": "The Page of Swords represents curiosity, mental energy, and new ideas. It signifies a youthful and inquisitive mindset, encouraging you to explore new concepts and communicate your thoughts clearly. This card often indicates the beginning of a learning journey or intellectual pursuit.",
      "meaning_reversed": "When reversed, the Page of Swords can indicate deception, lack of clarity, or miscommunication. You may be struggling to express your ideas or facing misunderstandings. It suggests a need to be honest and clear in your communication.",
      "advice": "Embrace your curiosity and seek out new knowledge. Communicate your ideas clearly and honestly, and be open to learning from others."
    },

    {
      "name": "Knight of Swords",
      "number": "12",
      "arcana": "Minor Arcana",
      "suit": "Swords",
      "img": "s12.jpg",
      "keywords_upright": ["Action", "Ambition", "Determination", "Quick Thinking"],
      "keywords_reversed": ["Recklessness", "Impulsiveness", "Lack of Direction", "Haste"],
      "meaning_upright": "The Knight of Swords represents action, ambition, and determination. It signifies a person who is driven and focused on achieving their goals. This card encourages you to take swift action and think quickly to overcome challenges.",
      "meaning_reversed": "Reversed, the Knight of Swords can indicate recklessness, impulsiveness, or lack of direction. You may be rushing into situations without careful consideration or feeling lost in your pursuits. It suggests a need to slow down and plan your actions thoughtfully.",
      "advice": "Take decisive action towards your goals, but be mindful of impulsiveness. Plan your steps carefully and maintain focus to achieve success."
    },
    {
      "name": "Queen of Swords",
      "number": "13",
      "arcana": "Minor Arcana",
      "suit": "Swords",
      "img": "s13.jpg",
      "keywords_upright": ["Independence", "Clarity", "Perceptiveness", "Truth"],
      "keywords_reversed": ["Coldness", "Bitterness", "Overly Critical", "Lack of Compassion"],
      "meaning_upright": "The Queen of Swords represents independence, clarity, and perceptiveness. She signifies a sharp intellect and the ability to see through illusions. This card encourages you to embrace truth and communicate with honesty and integrity.",
      "meaning_reversed": "When reversed, the Queen of Swords can indicate coldness, bitterness, or being overly critical. You may be struggling to connect emotionally or finding it difficult to show compassion. It suggests a need to balance intellect with empathy.",
      "advice": "Embrace your independence and seek clarity in your thoughts. Communicate honestly, but also practice compassion and empathy in your interactions with others."
    },
    {
      "name": "King of Swords",
      "number": "14",
      "arcana": "Minor Arcana",
      "suit": "Swords",
      "img": "s14.jpg",
      "keywords_upright": ["Authority", "Truth", "Intellect", "Fairness"],
      "keywords_reversed": ["Abuse of Power", "Manipulation", "Coldness", "Lack of Integrity"],
      "meaning_upright": "The King of Swords represents authority, truth, and intellect. He signifies a person who leads with fairness and integrity, using logic and reason to make decisions. This card encourages you to embrace your inner leader and uphold your values.",
      "meaning_reversed": "Reversed, the King of Swords can indicate abuse of power, manipulation, or lack of integrity. You may be struggling with ethical dilemmas or facing someone who is using their authority unfairly. It suggests a need to uphold your values and seek justice.",
      "advice": "Lead with integrity and fairness, using logic and reason in your decisions. Stand up for your values and seek justice in situations where power may be abused."
    },

    {
      "name": "Ace of Wands",
      "number": "1",
      "arcana": "Minor Arcana",
      "suit": "Wands",
      "img": "w01.jpg",
      "keywords_upright": ["New Beginnings", "Inspiration", "Creativity", "Potential"],
      "keywords_reversed": ["Delays", "Lack of Direction", "Missed Opportunities", "Creative Block"],
      "meaning_upright": "The Ace of Wands represents new beginnings, inspiration, and creativity. It signifies the potential for growth and the spark of new ideas. This card encourages you to embrace your creative energy and take bold steps towards your goals.",
      "meaning_reversed": "When reversed, the Ace of Wands can indicate delays, lack of direction, or missed opportunities. You may be struggling to find your creative spark or facing obstacles in your pursuits. It suggests a need to reassess your goals and find clarity.",
      "advice": "Embrace new beginnings and tap into your creative energy. Take bold steps towards your goals, but be mindful of potential delays and stay focused on your direction."
    },
    {
      "name": "Two of Wands",
      "number": "2",
      "arcana": "Minor Arcana",
      "suit": "Wands",
      "img": "w02.jpg",
      "keywords_upright": ["Planning", "Progress", "Decisions", "Future Vision"],
      "keywords_reversed": ["Lack of Planning", "Fear of Change", "Stagnation", "Indecision"],
      "meaning_upright": "The Two of Wands signifies planning, progress, and decisions. It represents a time of looking ahead and considering your options for the future. This card encourages you to take initiative and make plans to achieve your long-term goals.",
      "meaning_reversed": "Reversed, the Two of Wands can indicate lack of planning, fear of change, or stagnation. You may be feeling indecisive or hesitant to take action towards your goals. It suggests a need to overcome fears and create a clear plan for moving forward.",
      "advice": "Focus on planning and making decisions that align with your long-term vision. Overcome any fears of change and take proactive steps towards achieving your goals."
    },
    {
      "name": "Three of Wands",
      "number": "3",
      "arcana": "Minor Arcana",
      "suit": "Wands",
      "img": "w03.jpg",
      "keywords_upright": ["Expansion", "Growth", "Opportunities", "Looking Ahead"],
      "keywords_reversed": ["Delays", "Obstacles", "Lack of Foresight", "Missed Opportunities"],
      "meaning_upright": "The Three of Wands represents expansion, growth, and opportunities. It signifies a time of looking ahead and anticipating future success. This card encourages you to embrace new opportunities and continue expanding your horizons.",
      "meaning_reversed": "When reversed, the Three of Wands can indicate delays, obstacles, or missed opportunities. You may be facing challenges that hinder your progress or struggling to see the bigger picture. It suggests a need to reassess your plans and stay focused on your goals.",
      "advice": "Embrace opportunities for growth and expansion. Stay focused on your long-term vision and be prepared to overcome any obstacles that may arise."
    },
    {
      "name": "Four of Wands",
      "number": "4",
      "arcana": "Minor Arcana",
      "suit": "Wands",
      "img": "w04.jpg",
      "keywords_upright": ["Celebration", "Harmony", "Homecoming", "Stability"],
      "keywords_reversed": ["Conflict", "Instability", "Lack of Support", "Unrealistic Expectations"],
      "meaning_upright": "The Four of Wands signifies celebration, harmony, and stability. It represents a time of joy and togetherness, often related to home or community. This card encourages you to celebrate your achievements and enjoy the support of those around you.",
      "meaning_reversed": "Reversed, the Four of Wands can indicate conflict, instability, or lack of support. You may be experiencing tension in your relationships or feeling disconnected from your community. It suggests a need to address these issues and seek harmony.",
      "advice": "Celebrate your achievements and cherish the support of your community. Address any conflicts and work towards creating harmony and stability in your relationships."
    },
    {
      "name": "Five of Wands",
      "number": "5",
      "arcana": "Minor Arcana",
      "suit": "Wands",
      "img": "w05.jpg",
      "keywords_upright": ["Conflict", "Competition", "Tension", "Challenges"],
      "keywords_reversed": ["Resolution", "Avoiding Conflict", "Compromise", "Inner Peace"],
      "meaning_upright": "The Five of Wands represents conflict, competition, and challenges. It signifies a situation where there may be tension or disagreement, often leading to growth and learning. This card encourages you to embrace challenges and find constructive ways to resolve conflicts.",
      "meaning_reversed": "When reversed, the Five of Wands can indicate resolution, avoiding conflict, or inner peace. You may be finding ways to compromise and restore harmony in your relationships. It suggests a need to seek peaceful solutions and focus on cooperation.",
      "advice": "Embrace challenges and find constructive ways to resolve conflicts. Seek peaceful solutions and focus on cooperation to restore harmony in your relationships."
    },
    {
      "name": "Six of Wands",
      "number": "6",
      "arcana": "Minor Arcana",
      "suit": "Wands",
      "img": "w06.jpg",
      "keywords_upright": ["Victory", "Recognition", "Success", "Confidence"],
      "keywords_reversed": ["Ego", "Arrogance", "Lack of Recognition", "Self-Doubt"],
      "meaning_upright": "The Six of Wands signifies victory, recognition, and success. It represents a time of achievement and public acknowledgment for your efforts. This card encourages you to celebrate your accomplishments and embrace your confidence.",
      "meaning_reversed": "Reversed, the Six of Wands can indicate ego, arrogance, or self-doubt. You may be struggling with feelings of inadequacy or seeking validation from others. It suggests a need to focus on genuine self-worth and humility.",
      "advice": "Celebrate your successes and embrace your confidence. Avoid arrogance and focus on genuine self-worth, seeking validation from within rather than from external sources."
    },
    {
      "name": "Seven of Wands",
      "number": "7",
      "arcana": "Minor Arcana",
      "suit": "Wands",
      "img": "w07.jpg",
      "keywords_upright": ["Perseverance", "Defensiveness", "Courage", "Standing Your Ground"],
      "keywords_reversed": ["Giving Up", "Overwhelmed", "Lack of Confidence", "Avoiding Conflict"],
      "meaning_upright": "The Seven of Wands represents perseverance, courage, and standing your ground. It signifies a situation where you may need to defend your position or beliefs against opposition. This card encourages you to be brave and assertive in the face of challenges.",
      "meaning_reversed": "When reversed, the Seven of Wands can indicate giving up, feeling overwhelmed, or lack of confidence. You may be struggling to maintain your position or feeling discouraged by opposition. It suggests a need to regain your confidence and find strength to persevere.",
      "advice": "Stand your ground and be courageous in defending your beliefs. Regain your confidence and persevere through challenges, knowing that you have the strength to overcome opposition."
    },
    {
      "name": "Eight of Wands",
      "number": "8",
      "arcana": "Minor Arcana",
      "suit": "Wands",
      "img": "w08.jpg",
      "keywords_upright": ["Speed", "Action", "Movement", "Progress"],
      "keywords_reversed": ["Delays", "Frustration", "Lack of Progress", "Miscommunication"],
      "meaning_upright": "The Eight of Wands signifies speed, action, and progress. It represents a time of swift movement and forward momentum in your pursuits. This card encourages you to embrace change and take decisive action towards your goals.",
      "meaning_reversed": "Reversed, the Eight of Wands can indicate delays, frustration, or lack of progress. You may be facing obstacles that hinder your momentum or experiencing miscommunication. It suggests a need to reassess your plans and find ways to overcome these challenges.",
      "advice": "Embrace swift action and forward momentum in your pursuits. Be proactive in overcoming delays and miscommunication to maintain progress towards your goals."
    },
    {
      "name": "Nine of Wands",
      "number": "9",
      "arcana": "Minor Arcana",
      "suit": "Wands",
      "img": "w09.jpg",
      "keywords_upright": ["Resilience", "Persistence", "Courage", "Defensiveness"],
      "keywords_reversed": ["Exhaustion", "Burnout", "Giving Up", "Overwhelm"],
      "meaning_upright": "The Nine of Wands represents resilience, persistence, and courage. It signifies a situation where you may be facing challenges but are determined to persevere. This card encourages you to stay strong and defend your position, knowing that you have the strength to overcome obstacles.",
      "meaning_reversed": "When reversed, the Nine of Wands can indicate exhaustion, burnout, or feeling overwhelmed. You may be struggling to maintain your resilience or considering giving up. It suggests a need to take care of yourself and find ways to recharge your energy.",
      "advice": "Stay resilient and persistent in the face of challenges. Take care of yourself to avoid burnout, and remember that you have the strength to overcome obstacles."
    },
    {
      "name": "Ten of Wands",
      "number": "10",
      "arcana": "Minor Arcana",
      "suit": "Wands",
      "img": "w10.jpg",
      "keywords_upright": ["Burden", "Responsibility", "Hard Work", "Stress"],
      "keywords_reversed": ["Release", "Delegation", "Overwhelm", "Avoiding Responsibility"],
      "meaning_upright": "The Ten of Wands signifies burden, responsibility, and hard work. It represents a situation where you may be feeling weighed down by obligations or stress. This card encourages you to manage your responsibilities wisely and seek support if needed.",
      "meaning_reversed": "Reversed, the Ten of Wands can indicate release, delegation, or avoiding responsibility. You may be feeling overwhelmed and considering ways to lighten your load. It suggests a need to delegate tasks and find balance in your life.",
      "advice": "Manage your responsibilities wisely and seek support when needed. Delegate tasks to lighten your load and find balance to avoid overwhelm."
    },
    {
      "name": "Page of Wands",
      "number": "11",
      "arcana": "Minor Arcana",
      "suit": "Wands",
      "img": "w11.jpg",
      "keywords_upright": ["Enthusiasm", "Exploration", "New Ideas", "Adventure"],
      "keywords_reversed": ["Lack of Direction", "Procrastination", "Delays", "Unrealized Potential"],
      "meaning_upright": "The Page of Wands represents enthusiasm, exploration, and new ideas. It signifies a youthful and adventurous spirit, encouraging you to embrace new opportunities and explore your passions. This card often indicates the beginning of a creative journey or personal growth.",
      "meaning_reversed": "When reversed, the Page of Wands can indicate lack of direction, procrastination, or unrealized potential. You may be struggling to find your path or facing delays in your pursuits. It suggests a need to reassess your goals and take proactive steps towards realizing your potential.",
      "advice": "Embrace your enthusiasm and explore new opportunities. Take proactive steps towards your goals, and avoid procrastination to realize your full potential."
    },
    {
      "name": "Knight of Wands",
      "number": "12",
      "arcana": "Minor Arcana",
      "suit": "Wands",
      "img": "w12.jpg",
      "keywords_upright": ["Adventure", "Passion", "Energy", "Courage"],
      "keywords_reversed": ["Recklessness", "Impatience", "Lack of Direction", "Frustration"],
      "meaning_upright": "The Knight of Wands represents adventure, passion, and energy. It signifies a bold and courageous spirit, encouraging you to pursue your passions with enthusiasm. This card often indicates a time of action and movement towards your goals.",
      "meaning_reversed": "Reversed, the Knight of Wands can indicate recklessness, impatience, or lack of direction. You may be rushing into situations without careful consideration or feeling frustrated by obstacles. It suggests a need to slow down and plan your actions thoughtfully.",
      "advice": "Pursue your passions with enthusiasm and courage. However, be mindful of impulsiveness and take time to plan your actions carefully to avoid frustration."
    },
    {
      "name": "Queen of Wands",
      "number": "13",
      "arcana": "Minor Arcana",
      "suit": "Wands",
      "img": "w13.jpg",
      "keywords_upright": ["Confidence", "Independence", "Creativity", "Passion"],
      "keywords_reversed": ["Jealousy", "Insecurity", "Domineering", "Lack of Confidence"],
      "meaning_upright": "The Queen of Wands represents confidence, independence, and creativity. She signifies a vibrant and passionate energy, encouraging you to embrace your individuality and express your creativity. This card often indicates a strong and charismatic presence.",
      "meaning_reversed": "When reversed, the Queen of Wands can indicate jealousy, insecurity, or domineering behavior. You may be struggling with self-confidence or feeling threatened by others. It suggests a need to focus on building your self-esteem and embracing your unique qualities.",
      "advice": "Embrace your confidence and individuality. Express your creativity and focus on building self-esteem, avoiding jealousy or domineering behavior."
    },
    {
      "name": "King of Wands",
      "number": "14",
      "arcana": "Minor Arcana",
      "suit": "Wands",
      "img": "w14.jpg",
      "keywords_upright": ["Leadership", "Vision", "Inspiration", "Entrepreneurship"],
      "keywords_reversed": ["Impulsiveness", "Overbearing", "Lack of Direction", "Poor Leadership"],
      "meaning_upright": "The King of Wands represents leadership, vision, and inspiration. He signifies a dynamic and entrepreneurial spirit, encouraging you to lead with confidence and pursue your goals with passion. This card often indicates a strong and visionary leader.",
      "meaning_reversed": "Reversed, the King of Wands can indicate impulsiveness, overbearing behavior, or lack of direction. You may be struggling to lead effectively or feeling uncertain about your path. It suggests a need to regain focus and practice thoughtful leadership.",
      "advice": "Lead with confidence and pursue your goals with passion. Avoid impulsiveness and focus on thoughtful leadership to inspire others and achieve success."
    },
    {
      "name": "Ace of Pentacles",
      "number": "1",
      "arcana": "Minor Arcana",
      "suit": "Pentacles",
      "img": "p01.jpg",
      "keywords_upright": ["New Financial Opportunity", "Prosperity", "Manifestation", "Abundance"],
      "keywords_reversed": ["Missed Opportunity", "Financial Instability", "Lack of Planning", "Greed"],
      "meaning_upright": "The Ace of Pentacles represents new financial opportunities, prosperity, and manifestation. It signifies the potential for abundance and success in material aspects of life. This card encourages you to take practical steps towards your goals and embrace new beginnings.",
      "meaning_reversed": "When reversed, the Ace of Pentacles can indicate missed opportunities, financial instability, or lack of planning. You may be struggling to manifest your goals or facing setbacks in your material pursuits. It suggests a need to reassess your plans and focus on stability.",
      "advice": "Embrace new opportunities for financial growth and take practical steps towards your goals. Be mindful of planning and avoid greed or impulsive decisions."
    },
    {
      "name": "Two of Pentacles",
      "number": "2",
      "arcana": "Minor Arcana",
      "suit": "Pentacles",
      "img": "p02.jpg",
      "keywords_upright": ["Balance", "Adaptability", "Time Management", "Flexibility"],
      "keywords_reversed": ["Overwhelm", "Disorganization", "Imbalance", "Financial Stress"],
      "meaning_upright": "The Two of Pentacles represents balance, adaptability, and time management. It signifies the ability to juggle multiple responsibilities and maintain equilibrium in your life. This card encourages you to stay flexible and manage your resources wisely.",
      "meaning_reversed": "Reversed, the Two of Pentacles can indicate overwhelm, disorganization, or financial stress. You may be struggling to keep up with your commitments or feeling out of balance. It suggests a need to prioritize and regain control over your time and resources.",
      "advice": "Focus on maintaining balance and adaptability in your life. Prioritize your tasks and manage your time effectively to avoid overwhelm and stress."
    },
    {
      "name": "Three of Pentacles",
      "number": "3",
      "arcana": "Minor Arcana",
      "suit": "Pentacles",
      "img": "p03.jpg",
      "keywords_upright": ["Teamwork", "Collaboration", "Skill Development", "Recognition"],
      "keywords_reversed": ["Lack of Teamwork", "Disorganization", "Mediocrity", "Unrecognized Efforts"],
      "meaning_upright": "The Three of Pentacles signifies teamwork, collaboration, and skill development. It represents the importance of working with others to achieve common goals and the recognition of your efforts. This card encourages you to value the contributions of others and continue honing your skills.",
      "meaning_reversed": "When reversed, the Three of Pentacles can indicate a lack of teamwork, disorganization, or unrecognized efforts. You may be feeling undervalued or struggling to work effectively with others. It suggests a need to improve communication and organization within your team.",
      "advice": "Embrace collaboration and value the contributions of those around you. Focus on developing your skills and working effectively as part of a team to achieve shared success."
    },
    {
      "name": "Four of Pentacles",
      "number": "4",
      "arcana": "Minor Arcana",
      "suit": "Pentacles",
      "img": "p04.jpg",
      "keywords_upright": ["Security", "Control", "Conservation", "Stability"],
      "keywords_reversed": ["Greed", "Materialism", "Fear of Loss", "Insecurity"],
      "meaning_upright": "The Four of Pentacles represents security, control, and stability. It signifies a desire to hold onto what you have and maintain a sense of order in your life. This card encourages you to be mindful of your resources and focus on building a solid foundation.",
      "meaning_reversed": "Reversed, the Four of Pentacles can indicate greed, materialism, or fear of loss. You may be overly focused on accumulating wealth or possessions, leading to insecurity. It suggests a need to let go of material attachments and find balance.",
      "advice": "Focus on building a stable foundation while being mindful of not becoming overly attached to material possessions. Practice generosity and find security in non-material aspects of life."
    },
    {
      "name": "Five of Pentacles",
      "number": "5",
      "arcana": "Minor Arcana",
      "suit": "Pentacles",
      "img": "p05.jpg",
      "keywords_upright": ["Hardship", "Financial Loss", "Isolation", "Insecurity"],
      "keywords_reversed": ["Recovery", "Improved Finances", "Hope", "Support"],
      "meaning_upright": "The Five of Pentacles signifies hardship, financial loss, and insecurity. It represents a period of struggle or feeling left out in the cold. This card encourages you to seek support and remember that difficult times are temporary.",
      "meaning_reversed": "When reversed, the Five of Pentacles can indicate recovery, improved finances, and hope. You may be finding ways to overcome challenges and regain stability. It suggests a positive shift towards better circumstances.",
      "advice": "Seek support from others during difficult times and remember that hardships are temporary. Focus on recovery and take practical steps towards improving your situation."
    },
    {
      "name": "Six of Pentacles",
      "number": "6",
      "arcana": "Minor Arcana",
      "suit": "Pentacles",
      "img": "p06.jpg",
      "keywords_upright": ["Generosity", "Charity", "Balance", "Giving and Receiving"],
      "keywords_reversed": ["Selfishness", "Debt", "Inequality", "One-Sided Giving"],
      "meaning_upright": "The Six of Pentacles represents generosity, charity, and balance. It signifies the importance of giving and receiving in equal measure. This card encourages you to be generous with your resources and to seek balance in your relationships.",
      "meaning_reversed": "Reversed, the Six of Pentacles can indicate selfishness, debt, or inequality. You may be experiencing one-sided giving or feeling burdened by financial obligations. It suggests a need to reassess your approach to generosity and seek balance.",
      "advice": "Practice generosity and strive for balance in your relationships. Be mindful of both giving and receiving, ensuring that your actions are fair and equitable."
    },
    {
      "name": "Seven of Pentacles",
      "number": "7",
      "arcana": "Minor Arcana",
      "suit": "Pentacles",
      "img": "p07.jpg",
      "keywords_upright": ["Patience", "Long-Term Vision", "Investment", "Assessment"],
      "keywords_reversed": ["Impatience", "Lack of Long-Term Vision", "Poor Investment", "Frustration"],
      "meaning_upright": "The Seven of Pentacles signifies patience, long-term vision, and investment. It represents a period of assessment and reflection on your progress towards your goals. This card encourages you to be patient and trust that your efforts will yield results over time.",
      "meaning_reversed": "When reversed, the Seven of Pentacles can indicate impatience, lack of long-term vision, or poor investment. You may be feeling frustrated with slow progress or questioning the value of your efforts. It suggests a need to reassess your goals and approach.",
      "advice": "Be patient and maintain a long-term perspective on your goals. Trust that your efforts will pay off in time, and be willing to reassess your approach if necessary."
    },
    {
      "name": "Eight of Pentacles",
      "number": "8",
      "arcana": "Minor Arcana",
      "suit": "Pentacles",
      "img": "p08.jpg",
      "keywords_upright": ["Diligence", "Skill Development", "Hard Work", "Craftsmanship"],
      "keywords_reversed": ["Lack of Focus", "Mediocrity", "Workaholic", "Neglecting Other Areas"],
      "meaning_upright": "The Eight of Pentacles represents diligence, skill development, and hard work. It signifies a commitment to mastering your craft and putting in the necessary effort to achieve your goals. This card encourages you to focus on continuous improvement and take pride in your work.",
      "meaning_reversed": "Reversed, the Eight of Pentacles can indicate a lack of focus, mediocrity, or workaholism. You may be neglecting other areas of your life or struggling to maintain motivation. It suggests a need to find balance and avoid burnout.",
      "advice": "Commit to honing your skills and putting in the necessary effort to achieve your goals. However, be mindful of maintaining balance and avoiding burnout by attending to all areas of your life."
    },
    {
      "name": "Nine of Pentacles",
      "number": "9",
      "arcana": "Minor Arcana",
      "suit": "Pentacles",
      "img": "p09.jpg",
      "keywords_upright": ["Self-Sufficiency", "Luxury", "Financial Independence", "Discipline"],
      "keywords_reversed": ["Financial Dependence", "Overindulgence", "Lack of Discipline", "Materialism"],
      "meaning_upright": "The Nine of Pentacles signifies self-sufficiency, luxury, and financial independence. It represents the rewards of hard work and discipline, allowing you to enjoy the finer things in life. This card encourages you to take pride in your achievements and maintain your independence.",
      "meaning_reversed": "When reversed, the Nine of Pentacles can indicate financial dependence, overindulgence, or lack of discipline. You may be struggling to maintain your independence or feeling overly focused on material possessions. It suggests a need to reassess your values and priorities.",
      "advice": "Celebrate your achievements and enjoy the fruits of your labor. Strive for financial independence while being mindful of overindulgence and maintaining discipline in your pursuits."
    },
    {
      "name": "Ten of Pentacles",
      "number": "10",
      "arcana": "Minor Arcana",
      "suit": "Pentacles",
      "img": "p10.jpg",
      "keywords_upright": ["Wealth", "Family Legacy", "Long-Term Success", "Stability"],
      "keywords_reversed": ["Financial Failure", "Family Conflict", "Lack of Long-Term Vision", "Instability"],
      "meaning_upright": "The Ten of Pentacles represents wealth, family legacy, and long-term success. It signifies a stable and prosperous foundation built on hard work and dedication. This card encourages you to focus on creating lasting security for yourself and your loved ones.",
      "meaning_reversed": "Reversed, the Ten of Pentacles can indicate financial failure, family conflict, or lack of long-term vision. You may be experiencing instability or challenges within your family or financial situation. It suggests a need to address these issues and work towards stability.",
      "advice": "Focus on building a stable and prosperous foundation for yourself and your family. Address any conflicts or challenges openly and work towards long-term security and success."
    },
    {
      "name": "Page of Pentacles",
      "number": "11",
      "arcana": "Minor Arcana",
      "suit": "Pentacles",
      "img": "p11.jpg",
      "keywords_upright": ["Ambition", "Diligence", "New Opportunity", "Manifestation"],
      "keywords_reversed": ["Lack of Ambition", "Procrastination", "Missed Opportunity", "Lack of Focus"],
      "meaning_upright": "The Page of Pentacles represents ambition, diligence, and new opportunities. It signifies the beginning of a new venture or project, encouraging you to take practical steps towards your goals. This card emphasizes the importance of focus and hard work in manifesting your desires.",
      "meaning_reversed": "When reversed, the Page of Pentacles can indicate a lack of ambition, procrastination, or missed opportunities. You may be struggling to stay focused or feeling unmotivated. It suggests a need to reassess your goals and take action.",
      "advice": "Embrace new opportunities with ambition and diligence. Stay focused on your goals and take practical steps towards manifesting your desires."
    },
    {
      "name": "Knight of Pentacles",
      "number": "12",
      "arcana": "Minor Arcana",
      "suit": "Pentacles",
      "img": "p12.jpg",
      "keywords_upright": ["Hard Work", "Responsibility", "Practicality", "Persistence"],
      "keywords_reversed": ["Stubbornness", "Laziness", "Lack of Progress", "Overly Cautious"],
      "meaning_upright": "The Knight of Pentacles signifies hard work, responsibility, and practicality. It represents a steady and reliable energy, encouraging you to stay committed to your tasks and maintain a disciplined approach. This card emphasizes the importance of persistence in achieving your goals.",
      "meaning_reversed": "Reversed, the Knight of Pentacles can indicate stubbornness, laziness, or lack of progress. You may be feeling stuck or overly cautious in your approach. It suggests a need to break free from rigid patterns and embrace flexibility.",
      "advice": "Stay committed to your responsibilities and maintain a practical approach to your goals. However, be open to flexibility and avoid becoming overly rigid or cautious."
    },
    {
      "name": "Queen of Pentacles",
        "number": "13",
        "arcana": "Minor Arcana",
        "suit": "Pentacles",
        "img": "p13.jpg",
        "keywords_upright": ["Nurturing", "Practicality", "Financial Security", "Generosity"],
        "keywords_reversed": ["Self-Care Neglect", "Financial Insecurity", "Overly Materialistic", "Work-Life Imbalance"],
        "meaning_upright": "The Queen of Pentacles represents nurturing, practicality, and financial security. She signifies a grounded and caring energy, encouraging you to take care of both your material and emotional needs. This card emphasizes the importance of generosity and creating a comfortable environment.",
        "meaning_reversed": "When reversed, the Queen of Pentacles can indicate neglect of self-care, financial insecurity, or being overly materialistic. You may be struggling to balance your work and personal life or feeling disconnected from your nurturing side. It suggests a need to focus on self-care and reassess your priorities.",
        "advice": "Nurture yourself and those around you while maintaining practicality and financial security. Be generous, but also ensure you are taking care of your own needs and finding balance in your life."
    },
    {
      "name": "King of Pentacles",
      "number": "14",
      "arcana": "Minor Arcana",
      "suit": "Pentacles",
      "img": "p14.jpg",
      "keywords_upright": ["Wealth", "Business Acumen", "Stability", "Discipline"],
      "keywords_reversed": ["Greed", "Financial Mismanagement", "Stubbornness", "Lack of Discipline"],
      "meaning_upright": "The King of Pentacles represents wealth, business acumen, and stability. He signifies a successful and disciplined energy, encouraging you to take a practical approach to your financial and material goals. This card emphasizes the importance of responsibility and long-term planning.",
      "meaning_reversed": "Reversed, the King of Pentacles can indicate greed, financial mismanagement, or stubbornness. You may be struggling with maintaining discipline or feeling overly focused on material success. It suggests a need to reassess your values and approach to wealth.",
      "advice": "Focus on building long-term stability and success through responsible financial management. Avoid greed and remain open to new ideas and approaches in your pursuit of wealth."
    }
  ]
}